Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Perl 6 is the next major version of Perl, although it's not intended to replace Perl 5.
es_es: Perl 6 es la siguiente versión principal de Perl, pero no es un sustituto de Perl 5.

source: ISBN 978-0-596-51427-3 [July 2007]
es_es: ISBN 978-0-596-51427-3 [Julio de 2007]

source: For example, if you put C<{0,5}> instead of C<*> on the external group, no current optimization is applicable, and the match takes a long time to finish.
es_es: Por ejemplo, si pone C<{0,5}> en lugar de C<*> en el grupo externo, no se aplica ninguna optimización, y la coincidencia tarda mucho tiempo en terminar.

source: =item Write simple routines to do simple things.
es_es: =item Escriba rutinas sencillas para hacer cosas simples.

source: If your Perl book isn't listed and you think it should be, let us know.
es_es: Si su libro sobre Perl no está en la lista y cree que deberíamos incluirlo, póngase en contacto con nosotros.

source: =head1 NOTES
es_es: =head1 NOTAS

source: When you're done with your filehandles, you should C<close()> them (though to be honest, Perl will clean up after you if you forget):
es_es: Cuando termine de trabajar con los identificadores de archivo, debe cerrarlos con C<close()> (de todos modos, Perl se encargará de ello si se le olvida):

source: If C<use locale> is in effect, and POSIX::setlocale() has been called, the character used for the decimal separator is affected by the LC_NUMERIC locale.
es_es: Si C<use locale> está activo, y POSIX::setlocale() ha sido llamada, el carácter utilizado para el separador decimal se ve afectado por la configuración regional de LC_NUMERIC.

source: C<\1> in the usual double-quoted string means a control-A.
es_es: C<\1> en una cadena normal entrecomillada doble es un control-A.

source: This is useful for modifying a copy of something, like this:
es_es: Esto es útil para modificar una copia de algo, como esto:

source: *+ Match 0 or more times and give nothing back
es_es: *+ Coincide 0 o más veces y no devuelve nada

source: print vec($foo, 0, 8); # prints 80 == 0x50 == ord('P')
es_es: print vec($foo, 0, 8); # imprime 80 == 0x50 == ord('P')

source: while ($paragraph = <>) {
es_es: while ($parrafo = <>) {

source: Closes the file or pipe associated with the filehandle, flushes the IO buffers, and closes the system file descriptor.
es_es: Cierra el archivo o tubería asociada con el identificador de archivo, limpiando los búfer de E/S, y cierra el descriptor del archivo en el sistema.

source: Non-standard extensions in your local sprintf(3) are therefore unavailable from Perl.
es_es: Extensiones no estándares en su sprintf(3) regional, por lo tanto, no estará disponible desde Perl.

source: Prior to Perl 5.14, this wouldn't even compile:
es_es: Antes de Perl 5.14, esto ni siquiera hubiera compilado:

source: If the source number is between two numbers representable in the target form, a representation of one of these numbers is used.
es_es: Si el número de origen está entre dos números representables en la forma de destino, se usa una representación de uno de estos números.

source: C<File::Find> upgraded to version 1.10
es_es: C<File::Find> actualizado a la versión 1.10

source: You really probably want to be using C<my> instead, because C<local> isn't what most people think of as "local".
es_es: Lo que realmente querrá usar es C<my>, debido a que C<local> no es lo que la mayoría de la gente piensa en algo "local".

source: There is no Daylight Saving Time in GMT.
es_es: No hay horario de verano en el horario GMT.

source: This is grandfathered (for \1 to \9) for the RHS of a substitute to avoid shocking the B<sed> addicts, but it's a dirty habit to get into.
es_es: Se trata de vicios adquiridos (por \1 a \9) para el lado derecho de una sustitución para evitar escandalizar a los adictos del B<sed>, pero es un hábito sucio.

source: If it does both, scalar arguments come first and list argument follow, and there can only ever be one such list argument.
es_es: Si aparecen ambos, los argumentos escalares van antes que el argumento de lista, y solo puede existir un argumento de lista.

source: To be safe, always pass C<srand> an integer.
es_es: Para estar seguros, siempre pase un entero a C<srand>.

source: my @squares = map { $_ * $_ } grep { $_ > 5 } @numbers;
es_es: my @cuadrados = map { $_ * $_ } grep { $_ > 5 } @numeros;

source: This warning should have been already in 5.8.0, since they are.
es_es: Esta advertencia debería haber salido ya desde 5.8.0.

source: =head2 C Operators Missing From Perl X<operator, missing from perl> X<&> X<*> X<typecasting> X<(TYPE)>
es_es: =head2 Operadores de C que faltan en Perl X<operator, missing from perl> X<&> X<*> X<typecasting> X<(TYPE)> X<operador, faltan en Perl>

source: C<shift> and C<unshift> do the same thing to the left end of an array that C<pop> and C<push> do to the right end.
es_es: C<shift> y C<unshift> hacen lo mismo con el extremo izquierdo de un array que C<pop> y C<push> hacen para el extremo derecho.

source: =head1 Reporting Bugs
es_es: =head1 Informar de errores

source: Mentioning the ternary operator in this error message makes syntax diagnostic easier.
es_es: Mencionando el operador ternario en este mensaje de error hace más fácil la diagnosis de la sintaxis.

source: B<WARNING:> Calling delete on array values is deprecated and likely to be removed in a future version of Perl.
es_es: B<AVISO:> Usar delete en elementos de un array es una funcionalidad obsoleta y es probable que sea eliminada en una futura versión de Perl.

source: It is exactly equivalent to
es_es: Es exactamente equivalente a

source: Void context just means the value has been discarded, such as a statement containing only C<"fred";> or C<getpwuid(0);>.
es_es: El contexto vacío significa simplemente que el valor ha sido descartado, como en una instrucción que contenga solamente C<"fred";> o C<getpwuid(0);>.

source: DynaLoader::dl_unload_file() now works on Windows.
es_es: DynaLoader::dl_unload_file() ahora funciona en Windows.

source: Perl has most of the usual conditional and looping constructs.
es_es: Perl ofrece las estructuras condiciones y de bucle habituales.

source: Note that the braces are required in Perl, even if you've only got one line in the block.
es_es: Tenga en cuenta que en Perl es obligatorio usar las llaves, aunque sólo haya una línea en el bloque.

source: If you're particularly concerned with this, search the CPAN for random number generator modules instead of rolling out your own.
es_es: Si está especialmente preocupado por esto, busque en CPAN por módulos generadores de números aleatorios en lugar de desarrollar el suyo propio.

source: The Unicode F<NameAliases.txt> database file has been added.
es_es: El fichero base de datos Unicode F<NameAliases.txt> ha sido añadido.

source: perl586delta - what is new for perl v5.8.6
es_es: perl586delta - qué hay de nuevo para perl v5.8.6

source: =item syscall NUMBER, LIST X<syscall> X<system call>
es_es: =item syscall NÚMERO, LISTA X<syscall> X<system call> X<llamada del sistema>

source: The pattern really, I<really> wants to succeed, so it uses the standard pattern back-off-and-retry and lets C<\D*> expand to just "AB" this time.
es_es: El patrón, I<de verdad>, quiere tener éxito, por lo que utiliza el modelo estándar de marcha-atrás-e-inténtalo y permite que C<\D*> se expanda esta vez a solo "AB".

source: This is not good.
es_es: Esto no es bueno.

source: Converts a time as returned by the time function to a 9-element list with the time analyzed for the local time zone.
es_es: Convierte un tiempo devuelto por la función time() en una lista de 9 elementos según la zona horaria local.

source: For Mac OS X see README.macosx
es_es: Para Mac OS X vea README.macosx

source: See L</[8]> below for details on which character.
es_es: Vea L</[8]> más abajo, para detalles sobre este carácter.

source: There is no builtin C<import> function.
es_es: No existe la función C<import>.

source: This mark may be given a name.
es_es: A esta marca se le puede dar un nombre.

source: Note that some modules in this directory may not yet have been released separately on CPAN.
es_es: Tenga en cuenta que es posible que algunos de los módulos de este directorio aún no se hayan publicado por separado en CPAN.

source: The comments show the string after each step.
es_es: Los comentarios ponen de manifiesto la cadena después de cada etapa.

source: The remedy to this problem is to replace this code with the correct idiom:
es_es: El remedio para este problema es reemplazar este código con la expresión correcta:

source: @c = (0,1)[2,3]; # @c has no elements
es_es: @c = (0,1)[2,3]; # @c no tiene elementos

source: produce, respectively
es_es: produce, respectivamente

source: Be sure to specify Perl version requirements both in Makefile.PL or Build.PL and with C<require 5.6.1> or similar.
es_es: Asegúrese de especificar los requisitos de la versión de Perl, tanto en Makefile.PL o Build.PL y con C<require 5.6.1> o similar.

source: -X File is executable by real uid/gid.
es_es: -X Archivo es ejecutable por el uid/gid real.

source: -o File is owned by effective uid.
es_es: -o Archivo es propiedad del uid en vigor.

source: # or going the other way
es_es: # o de otra manera

source: These modules generally have their F<Makefile.PL> and are laid out more like a typical CPAN module.
es_es: Estos módulos suelen tener un archivo F<Makefile.PL> y su estructura es similar a la del típico módulo de CPAN.

source: A C<split> on C</\s+/> is like a S<C<split(' ')>> except that any leading whitespace produces a null first field.
es_es: Un C<split> con C</\s+/> es como un S<C<split(' ')>> excepto que cualquier espacio en blanco inicial produce un primer campo nulo.

source: If you needed to know the length of the string in bytes, now's the perfect time for that.
es_es: Si necesita averiguar la longitud de la cadena en bytes, ahora es el momento de hacerlo.

source: if (s|{.*| |) { $front = $_; while (<STDIN>) { if (/}/) { # end of comment?
es_es: if (s|{.*| |) { $frente = $_; while (<STDIN>) { if (/}/) { # ¿fin de comentario?

source: Perl modules provide a range of features to help you avoid reinventing the wheel, and can be downloaded from CPAN ( http://www.cpan.org/ ).
es_es: No pierda tiempo reinventando la rueda. Los módulos de Perl disponibles en CPAN (http://www.cpan.org/) proporcionan funcionalidad que puede utilizar en sus programas.

source: Remember, people often respond better to what they get out of it.
es_es: Recuerde que las personas suelen ser más receptivas cuando reciben algo.

source: If you omit the PERMS argument to C<sysopen>, Perl uses the octal value C<0666>.
es_es: Si se omite el argumento PERMISOS a C<sysopen>, Perl utiliza el valor octal C<0666>.

source: x Use extended regular expressions.
es_es: x Usa expresiones regulares extendidas.

source: =head1 AUTHOR AND COPYRIGHT
es_es: =head1 AUTOR Y COPYRIGHT

source: Even though it looks as though they're the same method calls (uid), they aren't, because a C<File::stat> object is different from a C<User::pwent> object.
es_es: Incluso aunque parezcan los mismos métodos (uid), no lo son, porque un objeto C<File::stat> es diferente de un objeto C<User::pwent>.

source: This means that one can have code called assertions sprinkled in the code: usually they are optimised away, but they can be enabled with the C<-A> option.
es_es: Esto significa que uno puede tener código llamado assertions salpicado en el código: suele ser optimizado, pero se puede activar con la opción C<-A> opción.

source: print(1+2) + 4; # Prints 3.
es_es: print(1+2) + 4; # Imprime 3.

# print "1: got $1 " if $x =~ /^(ABC)(?!123)/;
source: print "1: got $1\n" if $x =~ /^(ABC)(?!123)/;
es_es: print "1: tenemos $1\n" if $x =~ /^(ABC)(?!123)/;

source: perlapio Perl internal IO abstraction interface
es_es: perlapio Interfaz de abstracción de E/S interna

source: B<WARNING>: In perl 5.12.x and earlier, the regex engine was not re-entrant, so interpolated code could not safely invoke the regex engine either directly with C<m//> or C<s///>), or indirectly with functions such as C<split>.
es_es: B<AVISO>: En perl 5.12.x y anteriores, el motor regex es, actualmente, no re-entrante, por lo que el código interpolado no podrá invocar de forma segura el motor regex, tanto directamente con C<m//> o C<s///>, o indirectamente con funciones, como C<split>.

source: The C<use> function calls the C<import> method for the package used.
es_es: La función C<use> llama al método C<import> del paquete a usar.

source: You can use this to find out whether two handles refer to the same underlying descriptor:
es_es: Puede usar esto para encontrar cuándo dos identificadores de archivos se refieren al mismo descriptor subyacente:

source: Use the three-argument form to open a file with arbitrary weird characters in it,
es_es: Use la forma de tres argumentos para abrir un archivo con una cantidad arbitraria de caracteres extraños, en su nombre,

source: Primarily this is so that you can use the B<undump> program (not supplied) to turn your core dump into an executable binary after having initialized all your variables at the beginning of the program.
es_es: Principalmente esto se utiliza en conjunción con el programa B<undump> (no suministrado) para convertir tu volcado del núcleo en un binario ejecutable después de haber inicializado todas las variables al comienzo del programa.

source: If you want your program to be readable, consider supplying the argument.
es_es: Si usted quiere que su programa sea legible, considere suplir el argumento.

source: The restriction lasts to the end of the enclosing block.
es_es: La restricción dura hasta el final del bloque que lo alberga.

source: I can't say anything with regard to PPC.
es_es: No puedo decir nada con respecto a PPC.

source: # symbolic dereferencing
es_es: # desreferencia simbólica

source: open HANDLE, "< $file"
es_es: open HANDLE, "< $archivo"

source: perl590delta - what is new for perl v5.9.0
es_es: perl590delta - qué hay de nuevo en perl v5.9.0

source: S<[ [B<-e>|B<-E>] I<'command'> ] [ B<--> ] [ I<programfile> ] [ I<argument> ]...>
es_es: S<[ [B<-e>|B<-E>] I<'comando'> ] [ B<--> ] [ I<programa> ] [ I<argumento> ]...>

source: See the explanation for the C<(*MARK:NAME)> verb below for more details.
es_es: Vea la explicación del verbo C<(*MARK:NOMBRE)> abajo para obtener más detalles.

source: \v [3] Vertical whitespace
es_es: \v [3] Espacio en blanco vertical

source: This usage (which also works fine with system()) forces interpretation of the arguments as a multivalued list, even if the list had just one argument.
es_es: Este uso (que también funciona bien con system()) fuerza la interpretación de los argumentos como una lista multievaluada, incluso si la lista sólo tiene un argumento.

source: They are now.
es_es: Ahora lo son.

source: Some C macros have been tidied.
es_es: Algunas macros C se han arreglado.

source: How are you going to do that?
es_es: ¿Cómo va a hacer eso?

source: Byteorders C<"1234"> and C<"12345678"> are little-endian; C<"4321"> and C<"87654321"> are big-endian.
es_es: Las ordenaciones C<"1234"> y C<"12345678"> son little-endian; C<"4321"> y C<"87654321"> son big-endian.

source: Class::Struct: allow recursive classes
es_es: Class::Struct: permite clases recursivas

source: (The fact that a Perl interpreter and your code are in the same binary file is, in this case, a form of mere aggregation.) This is my interpretation of the GPL.
es_es: (El hecho de que un intérprete de Perl y su código estén en el mismo archivo binario es, en este caso, una forma de agregación simple.) Esta es mi interpretación de la GPL.

source: In scalar context, C<localtime()> returns the ctime(3) value:
es_es: En contexto escalar, C<localtime()> devuelve el valor de ctime(3):

source: One of them was found to be of more nuisance than benefit: the automagic (and silent) "UTF-8-ification" of filehandles, including the standard filehandles, if the user's locale settings indicated use of UTF-8.
es_es: Una de ellas resultó ser de más molestia que beneficio: la automágica (y silenciosa) "UTF-8-fijación" de los identificadores de archivo, incluyendo los identificadores de archivo estándar, si la configuración regional del usuario indica el uso de UTF-8.

source: Also, http://mirror.cpan.org/ has a nice interface to the http://www.cpan.org/MIRRORED.BY mirror directory.
es_es: Además, http://mirror.cpan.org/ ofrece una cómoda interfaz del directorio reflejado http://www.cpan.org/MIRRORED.BY .

source: For GMT instead of local time use the L</gmtime> builtin.
es_es: Para GMT, en lugar de la hora local, use la primitiva L</gmtime>.

source: Note also that the C<p> modifier is special in that its presence anywhere in a pattern has a global effect.
es_es: Tenga en cuenta que el modificador C<p> es especial, en que su presencia en cualquier lugar del patrón tiene un efecto global.

source: See L<perlop/Terms and List Operators (Leftward)>.
es_es: Vea L<perlop/Términos y Operadores de listas (por la izquierda)>.

source: =item Arithmetic
es_es: =item Aritmética

source: foreach $key (keys %HASH) {
es_es: foreach $clave (keys %HASH) {

source: For example, on POSIX-conforming systems, zero will signal the current process group and -1 will signal all processes.
es_es: Por ejemplo, en los sistemas conformes a POSIX, un cero señalará al grupo del proceso actual y -1 señalará todos los procesos.

source: perlreftut Perl references short introduction
es_es: perlreftut Breve introducción a las referencias

source: See L<charnames>.
es_es: Vea L<charnames>.

source: The shared object /usr/lib/libm.so did not resolve any symbols.
es_es: El objeto compartido /usr/lib/libm.so no resuelve a ningún símbolo.

source: Irix 6.2 Posix 1003.1b man pages
es_es: Irix 6.2 Posix 1003.1b páginas man

source: size => 1024,
es_es: tamaño => 1024,

source: $input++; # this is a string increment
es_es: $entrada++; # esto es un incremento de cadena

source: perlebcdic Considerations for running Perl on EBCDIC platforms
es_es: perlebcdic Ejecución de Perl en plataformas EBCDIC

source: # This will expand any embedded scalar variable
es_es: # Esto expandirá cualquier variables escalar incrustada

source: In fact, you can match on just about anything you could dream of by using more complex regular expressions.
es_es: De hecho, puede detectar coincidencias donde quiera con expresiones regulares más complejas.

source: $age{$a} <=> $age{$b}; # presuming numeric
es_es: $edad{$a} <=> $edad{$b}; # presumimos numéricos

source: If you want to map strings between lower/upper cases, see L<perlfunc/lc> and L<perlfunc/uc>, and in general consider using the C<s> operator if you need regular expressions.
es_es: Si desea mapear cadenas entre minúsculas/mayúsculas, vea L<perlfunc/lc> y L<perlfunc/uc>; y, en general, considere usar el operador C<s> si necesita usar expresiones regulares.

source: See also L</map> for a list composed of the results of the BLOCK or EXPR.
es_es: Ver también L</map> para una lista compuesta de los resultados del BLOQUE o EXPR.

source: See L<perlreftut> and L<perlref>.
es_es: Ver L<perlreftut> y L<perlref>.

source: This is a fully ported perl for VM/ESA 2.3.0.
es_es: Esta es una versión de perl completamente portado para VM/ESA 2.3.0.

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines, the pattern C<< (?P=NAME) >> may be used instead of C<< \k<NAME> >>.
es_es: B<NOTA:> Con el fin de facilitar las cosas a los programadores con experiencia en Python o motores regex PCRE, el patrón C<< (?P=NOMBRE) >> puede ser usado en lugar de C<< \k<NOMBRE> >>.

source: To get the 25 traditional lowercase Greek letters, including both sigmas, you could use this instead:
es_es: Para obtener las 25 letras minúsculas griegas, incluyendo ambos sigmas, puede usar esto:

source: nNvV Treat integers as signed instead of unsigned.
es_es: nNvV Trata a enteros como con signo, en lugar de sin signo.

source: \l lowercase next char (think vi)
es_es: \l pasar a minúscula el siguiente carácter (como en vi)

source: list %hash element: $array[0] $hash{'a'} &sub *glob SCALAR VALUES number, string, reference, glob, undef
es_es: lista %hash elemento: $array[0] $hash{'a'} &sub *glob VALORES ESCALARES número, cadena, referencia, glob, undef

source: As one example, the C<type> command under the POSIX shell is very different from the C<type> command under DOS.
es_es: Como ejemplo, el comando C<type> en el shell POSIX es muy diferente del comando C<type> en DOS.

source: chdir($tmpdir) or die "can't chdir $tmpdir: $!";
es_es: chdir($tmpdir) or die "no puede chdir $tmpdir: $!";

source: It is probably useful only when combined with C<(?{})> or C<(??{})>.
es_es: Es probable que sea útil cuando sólo se combine con C<(?{})> o C<(??{})>.

source: In both forms, the value returned is the value of the last expression evaluated inside the mini-program; a return statement may be also used, just as with subroutines.
es_es: En ambas formas, el valor devuelto es el valor de la última expresión evaluada dentro del mini-programa; una instrucción return se puede usar también, como si fuera una subrutina.

source: If FILEHANDLE is an expression, its value is used as the real filehandle wanted; an undefined scalar will be suitably autovivified.
es_es: Si IDENTIFICADOR_ARCHIVO es una expresión, el valor es tomado como el nombre real del identificador de archivo buscado; un escalar indefinido será autovivificado adecuadamente.

source: ### last always comes here
es_es: ### last siempre viene aquí

source: There are many books on Perl and Perl-related.
es_es: Hay muchos libros sobre Perl o relacionados con Perl.

source: C<Unicode::Collate->new> method no longer overwrites user's C<$_>
es_es: El método C<Unicode::Collate->new> ya no sobreescribe el C<$_> del usuario

source: open(ARTICLE, "caesar <$article |") # ditto
es_es: open(ARTICLE, "caesar <$article |") # lo mismo

source: Ensure your module works under C<use strict> and C<-w>
es_es: Asegúrese de que su módulo funciona bajo C<use strict> y C<-w>

source: Entire hashes are denoted by '%': X<hash>
es_es: Los hashes enteros se designan por '%': X<hash>

source: VARIABLE is the name of the variable to be enchanted.
es_es: VARIABLE es el nombre de la variable que será enlazada.

source: Note that this is a unary operator, not a list operator.
es_es: Tenga en cuenta que se trata de un operador unario, no un operador de lista.

source: See the independent subexpression L</C<< (?>pattern) >>> for more details; possessive quantifiers are just syntactic sugar for that construct.
es_es: Vea la subexpresión independiente L</C<< (?>patrón) >>> para obtener más detalles; los cuantificadores posesivos son el edulcorante sintáctico para esta construcción.

source: For delays of finer granularity than one second, the Time::HiRes module (from CPAN, and starting from Perl 5.8 part of the standard distribution) provides usleep().
es_es: Para lapsos de tiempo inferiores a un segundo, el módulo Time::HiRes (en CPAN, y desde Perl 5.8 parte de la distribución estándar) ofrece usleep().

source: For example, to indicate that an option is to be interpreted by the TCP protocol, LEVEL should be set to the protocol number of TCP, which you can get using C<getprotobyname>.
es_es: Por ejemplo, para indicar que una opción a de ser interpretada por el protocolo TCP, NIVEL debe ser puesto al número de protocolo del TCP, que puede obtener usando C<getprotobyname>.

source: perlos400 Perl notes for OS/400
es_es: perlos400 Notas para OS/400

source: What's that C<shift>?
es_es: ¿Qué hace C<shift>?
